{
    "modelTopology": {
        "model_config": {
            "class_name": "Model",
            "config": {
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "name": "input",
                        "inbound_nodes": [
                            []
                        ],
                        "config": {
                            "batch_input_shape": [
                                1,
                                518,
                                518,
                                3
                            ],
                            "_status": "SIMA_QUANTIZED",
                            "type": {
                                "scalar": {
                                    "__decode_key__": "ScalarType",
                                    "value": 6
                                },
                                "shape": {
                                    "vals": [
                                        1,
                                        518,
                                        518,
                                        3
                                    ],
                                    "__decode_key__": "tuple"
                                },
                                "__decode_key__": "TensorType"
                            },
                            "quantization": null,
                            "_output_types": [
                                {
                                    "scalar": {
                                        "__decode_key__": "ScalarType",
                                        "value": 6
                                    },
                                    "shape": {
                                        "vals": [
                                            1,
                                            518,
                                            518,
                                            3
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "__decode_key__": "TensorType"
                                }
                            ],
                            "_metadata": "{\"relay_ir_name\": \"input\"}",
                            "name": "input"
                        }
                    },
                    {
                        "class_name": "QuantizationTransform_0",
                        "name": "quantize_0",
                        "inbound_nodes": [
                            [
                                [
                                    "input",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "channel_params": [
                                [
                                    47.69759031049446,
                                    -22
                                ]
                            ],
                            "input_shape": [
                                1,
                                518,
                                518,
                                3
                            ],
                            "num_bits": 8,
                            "rounding": "TONEAREST",
                            "output_data_type": {
                                "__decode_key__": "ScalarType",
                                "value": 1
                            },
                            "_status": "SIMA_QUANTIZED",
                            "_input_types": [
                                [
                                    {
                                        "scalar": {
                                            "__decode_key__": "ScalarType",
                                            "value": 6
                                        },
                                        "shape": {
                                            "vals": [
                                                1,
                                                518,
                                                518,
                                                3
                                            ],
                                            "__decode_key__": "tuple"
                                        },
                                        "__decode_key__": "TensorType"
                                    }
                                ]
                            ],
                            "_output_types": [
                                {
                                    "scalar": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "shape": {
                                        "vals": [
                                            1,
                                            518,
                                            518,
                                            3
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "__decode_key__": "TensorType"
                                }
                            ],
                            "_metadata": "{\"relay_ir_name\": \"\"}",
                            "name": "quantize_0"
                        }
                    },
                    {
                        "class_name": "MLA_0/Conv2DAddActivation_1",
                        "name": "MLA_0/conv2d_add_1",
                        "inbound_nodes": [
                            [
                                [
                                    "quantize_0",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "_status": "SIMA_QUANTIZED",
                            "input_shape": [
                                1,
                                518,
                                518,
                                3
                            ],
                            "conv_attrs.channels": 384,
                            "conv_attrs.data_layout": "NHWC",
                            "conv_attrs.dilation": [
                                1,
                                1,
                                1,
                                1
                            ],
                            "conv_attrs.groups": 1,
                            "conv_attrs.kernel_layout": "HWIO",
                            "conv_attrs.kernel_size": [
                                14,
                                14
                            ],
                            "conv_attrs.out_dtype": "float32",
                            "conv_attrs.out_layout": "",
                            "conv_attrs.padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ]
                            ],
                            "conv_attrs.strides": [
                                1,
                                14,
                                14,
                                1
                            ],
                            "weight_quant_data": "np_arr_0",
                            "requant": {
                                "__decode_key__": "ArithFoldedRequantization"
                            },
                            "scale": 103.89980412016298,
                            "zero_point": 0,
                            "input_zp": -22,
                            "bias_quant_data": "np_arr_1",
                            "weight_bits": 8,
                            "axis": -1,
                            "bits": 8,
                            "per_channel": true,
                            "activ_attrs": null,
                            "input_int16": false,
                            "msb_left_shift": false,
                            "_input_types": [
                                [
                                    {
                                        "scalar": {
                                            "__decode_key__": "ScalarType",
                                            "value": 1
                                        },
                                        "shape": {
                                            "vals": [
                                                1,
                                                518,
                                                518,
                                                3
                                            ],
                                            "__decode_key__": "tuple"
                                        },
                                        "__decode_key__": "TensorType"
                                    }
                                ]
                            ],
                            "_output_types": [
                                {
                                    "scalar": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "__decode_key__": "TensorType"
                                }
                            ],
                            "_metadata": "{\"relay_ir_name\": \"conv2d_add\"}",
                            "name": "MLA_0/conv2d_add_1"
                        }
                    },
                    {
                        "class_name": "MLA_0/SliceConcat_2",
                        "name": "MLA_0/slice_concat_2",
                        "inbound_nodes": [
                            [
                                [
                                    "MLA_0/conv2d_add_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "_status": "SIMA_QUANTIZED",
                            "slice_attrs": [
                                {
                                    "begin": {
                                        "vals": [
                                            0
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            2
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            2
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            3
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            3
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            4
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            4
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            5
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            5
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            6
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            6
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            7
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            7
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            8
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            8
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            9
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            9
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            10
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            10
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            11
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            11
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            12
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            12
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            13
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            13
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            14
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            14
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            15
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            15
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            16
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            16
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            17
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            17
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            18
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            18
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            19
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            19
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            20
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
                                        "vals": [
                                            1,
                                            37,
                                            37,
                                            384
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "input_type": {
                                        "__decode_key__": "ScalarType",
                                        "value": 1
                                    },
                                    "__decode_key__": "StridedSliceAttrs"
                                },
                                {
                                    "begin": {
                                        "vals": [
                                            20
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "end": {
                                        "vals": [
                                            21
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "strides": {
                                        "vals": [
                                            1
                                        ],
                                        "__decode_key__": "tuple"
                                    },
                                    "axes": [
                                        1
                                    ],
                                    "slice_mode": "end",
                                    "input_shape": {
